# -*- coding: utf-8 -*-
'''
Задание 5.2

Запросить у пользователя ввод IP-сети в формате: 10.1.1.0/24

Затем вывести информацию о сети и маске в таком формате:

Network:
10        1         1         0
00001010  00000001  00000001  00000000

Mask:
/24
255       255       255       0
11111111  11111111  11111111  00000000

Проверить работу скрипта на разных комбинациях сеть/маска.

Ограничение: Все задания надо выполнять используя только пройденные темы.
'''

network = input('Введите IP сеть в формате: 10.1.1.0/24''\n')
commands = network.split('/')
Network = commands[0]
mask = commands[1]
print('\n' + 'Network:')
Net=Network.split('.')
a = int(Net[0])
b = int(Net[1])
c = int(Net[2])
d = int(Net[3])
result_ip = '{0:<8} {1:<8} {2:<8} {3:<8}\n{0:08b} {1:08b} {2:08b} {3:08b}'.format(a,b,c,d)
print(result_ip+'\n')
print('Mask:'+'\n'+'/'+mask)
